/*
Baekjoon
<9498. 시험 성적>

문제
시험 점수를 입력받아 90 ~ 100점은 A, 80 ~ 89점은 B, 70 ~ 79점은 C, 
60 ~ 69점은 D, 나머지 점수는 F를 출력하는 프로그램을 작성하시오.
===============================================================================================
입력
첫째 줄에 시험 점수가 주어진다. 시험 점수는 0보다 크거나 같고, 100보다 작거나 같은 정수이다.

출력
시험 성적을 출력한다.
===============================================================================================
*/

#include <iostream>
using namespace::std;
int main(){
    ios::sync_with_stdio(0);
    cin.tie(0);
        
    int score;
    cin >> score;
        
    if(90 <= score && score <= 100)  cout << 'A';
    else if(80 <= score)  cout << 'B';
    else if(70 <= score)  cout << 'C';
    else if(60 <= score)  cout << 'D';
    else cout << 'F';
}